package com.tencent.token.global;

public class e
{
  public static String[] a = { "A", "B", "C", "D", "E", "F", "G", "H", "J", "K", "L", "M", "N", "P", "Q", "R", "S", "T", "W", "X", "Y", "Z" };
  public static String[][] b;
  public static String[][] c;
  
  static
  {
    String[] arrayOfString1 = { "86", "中国大陆" };
    String[] arrayOfString2 = { "852", "中国香港" };
    String[] arrayOfString3 = { "886", "中国台湾" };
    String[] arrayOfString4 = { "1", "美国" };
    String[] arrayOfString5 = { "81", "日本" };
    String[] arrayOfString6 = { "1", "加拿大" };
    b = new String[][] { arrayOfString1, arrayOfString2, { "853", "中国澳门" }, arrayOfString3, arrayOfString4, arrayOfString5, { "82", "韩国" }, { "65", "新加坡" }, arrayOfString6, { "61", "澳大利亚" } };
    arrayOfString1 = new String[] { "220", "冈比亚" };
    arrayOfString2 = new String[] { "964", "伊拉克" };
    arrayOfString3 = new String[] { "1758", "圣卢西亚" };
    c = new String[][] { { "86", "中国" }, { "1", "美国" }, { "81", "日本" }, { "82", "韩国" }, { "65", "新加坡" }, { "1", "加拿大" }, { "61", "澳大利亚" }, { "7", "俄罗斯" }, { "20", "埃及" }, { "27", "南非\t" }, { "30", "希腊" }, { "31", "荷兰\t" }, { "32", "比利时" }, { "33", "法国" }, { "34", "西班牙" }, { "36", "匈牙利" }, { "39", "意大利" }, { "40", "罗马尼亚" }, { "41", "瑞士" }, { "43", "奥地利" }, { "44", "英国" }, { "45", "丹麦" }, { "46", "瑞典" }, { "47", "挪威" }, { "48", "波兰" }, { "49", "德国" }, { "51", "秘鲁" }, { "52", "墨西哥" }, { "53", "古巴" }, { "54", "阿根廷" }, { "55", "巴西" }, { "56", "智利" }, { "57", "哥伦比亚" }, { "58", "委内瑞拉" }, { "60", "马来西亚" }, { "62", "印度尼西亚" }, { "63", "菲律宾" }, { "64", "新西兰" }, { "66", "泰国" }, { "84", "越南" }, { "90", "土耳其" }, { "91", "印度" }, { "92", "巴基斯坦" }, { "93", "阿富汗" }, { "94", "斯里兰卡" }, { "95", "缅甸" }, { "98", "伊朗" }, { "212", "摩洛哥" }, { "213", "阿尔及利亚" }, { "216", "突尼斯" }, { "218", "利比亚" }, arrayOfString1, { "221", "塞内加尔" }, { "223", "马里" }, { "224", "几内亚" }, { "225", "科特迪瓦共和国" }, { "226", "布基纳法索国" }, { "227", "尼日尔" }, { "228", "多哥" }, { "229", "贝宁" }, { "230", "毛里求斯" }, { "231", "利比里亚" }, { "232", "塞拉利昂" }, { "233", "加纳" }, { "234", "尼日利亚" }, { "235", "乍得" }, { "236", "中非共和国" }, { "237", "喀麦隆" }, { "239", "圣多美和普林西比" }, { "241", "加蓬" }, { "242", "刚果共和国（布）" }, { "243", "刚果民主共和国（金）" }, { "244", "安哥拉" }, { "248", "塞舌尔" }, { "249", "苏丹" }, { "251", "埃塞俄比亚" }, { "252", "索马里" }, { "253", "吉布提" }, { "254", "肯尼亚" }, { "255", "坦桑尼亚" }, { "256", "乌干达" }, { "257", "布隆迪" }, { "258", "莫桑比克" }, { "260", "赞比亚" }, { "261", "马达加斯加" }, { "263", "津巴布韦" }, { "264", "纳米比亚" }, { "265", "马拉维" }, { "266", "莱索托" }, { "267", "博茨瓦纳" }, { "350", "直布罗陀" }, { "351", "葡萄牙" }, { "352", "卢森堡" }, { "353", "爱尔兰" }, { "354", "冰岛" }, { "355", "阿尔巴尼亚" }, { "356", "马耳他" }, { "357", "塞浦路斯" }, { "358", "芬兰" }, { "359", "保加利亚" }, { "370", "立陶宛" }, { "371", "拉脱维亚" }, { "372", "爱沙尼亚" }, { "373", "摩尔多瓦" }, { "374", "亚美尼亚" }, { "375", "白俄罗斯" }, { "376", "安道尔" }, { "377", "摩纳哥" }, { "378", "圣马力诺" }, { "380", "乌克兰" }, { "386", "斯洛文尼亚" }, { "420", "捷克共和国" }, { "421", "斯洛伐克" }, { "423", "列支敦士登" }, { "501", "伯利兹" }, { "502", "危地马拉" }, { "503", "萨尔瓦多" }, { "504", "洪都拉斯" }, { "505", "尼加拉瓜" }, { "506", "哥斯达黎加" }, { "507", "巴拿马" }, { "509", "海地" }, { "591", "玻利维亚" }, { "592", "圭亚那" }, { "593", "厄瓜多尔" }, { "595", "巴拉圭" }, { "594", "法属圭亚那" }, { "597", "苏里南" }, { "598", "乌拉圭" }, { "673", "文莱" }, { "674", "瑙鲁" }, { "675", "巴布亚新几内亚" }, { "676", "汤加" }, { "677", "所罗门群岛" }, { "679", "斐济" }, { "682", "库克群岛" }, { "689", "法属波利尼西亚" }, { "850", "朝鲜" }, { "855", "柬埔寨" }, { "856", "老挝" }, { "880", "孟加拉国" }, { "960", "马尔代夫" }, { "961", "黎巴嫩" }, { "962", "约旦" }, { "963", "叙利亚" }, arrayOfString2, { "965", "科威特" }, { "966", "沙特阿拉伯" }, { "967", "也门" }, { "968", "阿曼" }, { "971", "阿拉伯联合酋长国" }, { "972", "以色列" }, { "973", "巴林" }, { "974", "卡塔尔" }, { "976", "蒙古" }, { "977", "尼泊尔" }, { "992", "塔吉克斯坦" }, { "993", "土库曼斯坦" }, { "994", "阿塞拜疆" }, { "995", "格鲁吉亚" }, { "996", "吉尔吉斯斯坦" }, { "998", "乌兹别克斯坦" }, { "1242", "巴哈马" }, { "1246", "巴巴多斯" }, { "1264", "安圭拉岛" }, { "1441", "百慕大" }, { "1473", "格林纳达" }, { "1671", "关岛" }, arrayOfString3, { "1767", "多米尼克" }, { "1784", "圣文森特和格林纳丁斯" }, { "1787", "波多黎各+1787" }, { "1809", "多米尼加共和国" }, { "1868", "特立尼达和多巴哥" }, { "1876", "牙买加" }, { "1939", "波多黎各+1939" }, { "684", "美属萨摩亚" }, { "268", "安提瓜及巴布达" }, { "297", "阿鲁巴" }, { "975", "不丹" }, { "387", "波斯尼亚和黑塞哥维那" }, { "238", "佛得角" }, { "1345", "开曼群岛" }, { "269", "科摩洛" }, { "385", "克罗地亚共和国" }, { "240", "赤道几内亚" }, { "291", "厄立特里亚省" }, { "500", "福克兰群岛" }, { "298", "法罗群岛" }, { "299", "格陵兰岛" }, { "590", "瓜德罗普" }, { "245", "几内亚比绍" }, { "7", "哈萨克斯坦" }, { "686", "基里巴斯共和国" }, { "389", "马其顿" }, { "222", "毛里塔尼亚" }, { "262", "马约特" }, { "691", "密克罗尼西亚" }, { "382", "黑山共和国" }, { "1664", "蒙特塞拉特" }, { "599", "荷属安的列斯" }, { "687", "新喀里多尼亚岛" }, { "167", "北马里亚纳" }, { "970", "巴勒斯坦" }, { "250", "卢旺达" }, { "1869", "圣基茨和尼维斯" }, { "685", "萨摩亚" }, { "381", "塞尔维亚" }, { "670", "东帝汶" }, { "690", "托克劳" }, { "868", "特立尼达岛和多巴哥" }, { "1649", "特克斯和凯科斯群岛" }, { "688", "吐瓦鲁" }, { "678", "瓦努阿图" }, { "379", "梵蒂冈" }, { "1284", "英属维尔京群岛" }, { "1340", "美属维尔京群岛" }, { "681", "沃利斯和富图纳群岛" }, { "692", "马绍尔群岛共和国" }, { "683", "纽埃" } };
  }
}


/* Location:           L:\local\mybackup\temp\qq_apk\com.tencent.token\classes.jar
 * Qualified Name:     com.tencent.token.global.e
 * JD-Core Version:    0.7.0.1
 */