package com.tencent.mobileqq.lovelanguage;

public class LoveLanguageConfig
{
  public static final int[] a;
  public static final String[] a;
  
  static
  {
    jdField_a_of_type_ArrayOfJavaLangString = new String[] { "asshole", "bitch", "damn you", "fuck", "go to hell", "shit", "爆菊", "碧莲", "婊子", "草泥马", "尼玛", "丢你老母", "法克鱿", "狗屁", "滚蛋", "绿茶婊", "去你大爷", "去你妈的", "我去你妹", "死胖子", "日你妈", "弱智", "他妈的", "王八蛋", "我靠", "猪一样", "fatty", "idiot", "菊花残", "没屁眼", "臭婊砸", "贱逼", "该死的", "操你", "去死吧", "白痴", "傻瓜", "痴线", "傻屌", "傻逼", "吃屎", "捅你菊花", "插你菊花", "屁眼交易", "卧槽", "我操", "丢雷老母", "狗屎", "混蛋", "操蛋", "妈蛋", "老不死", "你妈逼", "干你妹的", "操你妹的", "表要脸", "去他喵的", "龟儿子", "老王八", "龟孙", "我日", "狗日的", "猪脑", "猪头", "心机婊", "我草", "脑残" };
    jdField_a_of_type_ArrayOfInt = new int[] { 2130839327, 2130839328, 2130839339, 2130839346, 2130839347, 2130839348, 2130839349, 2130839350, 2130839351, 2130839352, 2130839352, 2130839330, 2130839331, 2130839332, 2130839333, 2130839334, 2130839335, 2130839336, 2130839337, 2130839338, 2130839340, 2130839341, 2130839342, 2130839343, 2130839344, 2130839345, 2130839338, 2130839341, 2130839327, 2130839327, 2130839328, 2130839328, 2130839339, 2130839346, 2130839347, 2130839341, 2130839341, 2130839341, 2130839341, 2130839341, 2130839348, 2130839349, 2130839349, 2130839349, 2130839329, 2130839329, 2130839330, 2130839332, 2130839333, 2130839333, 2130839333, 2130839335, 2130839336, 2130839337, 2130839337, 2130839351, 2130839342, 2130839343, 2130839343, 2130839343, 2130839340, 2130839340, 2130839345, 2130839345, 2130839334, 2130839329, 2130839341 };
  }
  
  public static boolean a(String paramString)
  {
    return false;
  }
}


/* Location:           L:\local\mybackup\temp\qq_apk\com.tencent.mobileqq\classes2.jar
 * Qualified Name:     com.tencent.mobileqq.lovelanguage.LoveLanguageConfig
 * JD-Core Version:    0.7.0.1
 */